Extensions/ИнтеграцияGreenApi/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Событие</Name>
		</Properties>
	</Document>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>iga_ДиалогWhatsApp</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛичнаяВстреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИсходящийЗвонок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Documents/Событие/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура iga_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.iga_ДиалогWhatsApp") Тогда
		ДопСвойства.Вставить("ХранилищеСсылки", Параметры.Основание.ХранилищеСсылки);
	КонецЕсли;
	Элементы.ВидСобытия.СписокВыбора.Добавить(Перечисления.ВидыСобытий.iga_ДиалогWhatsApp);
	
КонецПроцедуры

&НаКлиенте
Процедура iga_ПриЗакрытииПосле(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Ключ.Пустая() И ДопСвойства.Свойство("ХранилищеСсылки") Тогда
		ПоместитьВоВременноеХранилище(Параметры.Ключ, ДопСвойства.ХранилищеСсылки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("НастроитьВидимостьДоступность")
Процедура iga_НастроитьВидимостьДоступность()
	
	ЭтоЗвонок = (Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок")
		Или Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.ИсходящийЗвонок")
		Или Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.iga_ДиалогWhatsApp"));

	// Звонки
	Элементы.ГруппаЗвонок.Доступность = ЭтоЗвонок;
	Элементы.ФормаНачатьРазговор.Доступность = ЭтоЗвонок И ИспользоватьCallЦентр И Не Объект.ЗвонокНачат;
	Элементы.ФормаНачатьРазговорМонитор.Доступность = Элементы.ФормаНачатьРазговор.Доступность;	
	Элементы.ДлительностьВремя.Доступность = ЭтоЗвонок И ИспользоватьCallЦентр;
	
КонецПроцедуры
